import { PreviousPyconkr } from '../../data/enums/PreviousPyconkr'

export default {
    [PreviousPyconkr.PYCONKR_2021]: {
        title: '파이콘 한국 2021',
        paragraph:
            '파이콘 한국 2021은 10월 2일부터 3일까지 2일간 "Stay Home, Stay Connected" 를 주제로 온라인에서 개최되었습니다. 본 행사는 38개의 세션으로 구성되었으며, 이는 모두 발표자 및 진행자 분들의 기여로 준비되었습니다. 세계적인 팬데믹으로 오프라인 만남에 아쉬움을 느끼던 파이써니스타들을 위해 온라인 네트워킹 플랫폼인 게더(Gather)에서 함께 세션을 관람하고 자유롭게 네트워킹을 할 수 있는 환경을 구축했습니다.',
        url: 'https://2021.pycon.kr'
    },
    [PreviousPyconkr.PYCONKR_2020]: {
        title: '파이콘 한국 2020',
        paragraph:
            '파이콘 한국 2020은 9월 26일부터 27일까지 2일간 "We are Pythonistas" 를 주제로 온라인에서 개최되었습니다. 본 행사는 3개의 키노트와 35개의 세션으로 구성되었으며, 이는 모두 발표자 및 진행자 분들의 기여로 준비되었습니다. 파이콘 한국의 첫 온라인 행사로, 보다 많은 참가자들이 즐길 수 있도록 티켓을 무료로 전환하였고, 후원사들에게는 홈페이지에서 커스터마이징을 할 수 있는 버추얼 부스를 제공하여 진행했습니다.',
        url: 'https://pycon.kr/2020'
    },
    [PreviousPyconkr.PYCONKR_2019]: {
        title: '파이콘 한국 2019',
        paragraph:
            '파이콘 한국 2019는 8월 15일부터 18일까지 4일간 "Connect the Pythonistas (파이써니스타를 연결하다)" 를 주제로 코엑스 그랜드볼룸에서 개최되었습니다. 본 행사에서는 4개의 키노트와 49개의 세션, 24개의 튜토리얼, 7개의 스프린트를 발표자 및 진행자 분들의 기여로 준비되었으며 1800여 명의 참가자가 참가하였습니다. 처음 파이콘을 찾아오신 참가자들을 안내하는 웰컴존과 후원사가 참여자들의 목소리를 듣고 자사에 대해 알릴 수 있는 기회를 드리고자 열린 점심을 추가로 진행했습니다.',
        url: 'https://archive.pycon.kr/2019'
    },
    [PreviousPyconkr.PYCONKR_2018]: {
        title: '파이콘 한국 2018',
        paragraph:
            '파이콘 한국 2018은 8월 15, 17-19일까지 4일간 ‘Dive into Diversity’라는 주제로 코엑스 그랜드볼룸에서 개최되었습니다. 본 행사는 1800여 명의 참가자, 73(56개의 세션, 17개의 라이트닝 토크)명의 발표자, 22명의 준비위원 그리고 51명의 자원봉사자들이 함께 해 성대하게 진행하였습니다. 파이콘 2018에서는 오랜 시간 책상에 앉아서 일하는 개발자들을 위한 스트레칭 세션을 처음으로 진행하였고, AUD와 협력하여 개발 컨퍼런스 중에서는 처음으로 자막 통역을 진행하였으며, 이를 기반으로 영상 자막도 준비하고 있습니다. 행사의 성숙도 또한 성장하여 한국의 대표적인 개발 컨퍼런스로서 자리매김한 행사가 되었습니다.',
        url: 'https://archive.pycon.kr/2018'
    },
    [PreviousPyconkr.PYCONKR_2017]: {
        title: '파이콘 한국 2017',
        paragraph:
            '파이콘 한국 2017은 8월 12일부터 15일까지 4일간 ‘Back to the Basic’을 주제로 코엑스 그랜드볼룸에서 개최되었습니다. 본 행사는 1800여 명의 참가자, 60명의 발표자, 26명의 스태프 그리고 41명의 자원봉사자들이 함께 해 성대하게 진행하였습니다. 파이콘 2017에서는 처음으로 초등학교 고학년 이상 학생을 위한 파이썬 교육 프로그램 ‘영코더’, 미취학 아동을 안심하고 맡길 수 있는 ‘아이돌봄’ 을 제공하여 자녀와 함께 부담없이 참가할 수 있도록 하는 시도들을 하였고 참가자들로부터 많은 호평을 받았습니다. 행사의 규모가 큰 폭으로 커졌고 성숙도 또한 성장하여 한국의 대표적인 개발 컨퍼런스로서 자리매김한 행사가 되었습니다.',
        url: 'https://archive.pycon.kr/2017'
    },
    [PreviousPyconkr.PYCONAPAC_2016]: {
        title: '파이콘 APAC 2016',
        paragraph:
            '파이콘은 전세계 각지에서 열리는 파이썬 개발자들의 컨퍼런스이자 축제이며 그중 파이콘 APAC은 아시아 파이썬 개발자들이 모이는 커다란 행사 입니다. 2015, 2014년에는 대만에서 열렸으며 2013년에는 일본, 2012년에는 싱가포르에서 개최되었습니다. 2016년에는 한국에서 성대하게 열리며 코엑스 그랜드볼룸에서 1500명 이상의 참가자와 각국에서 오는 유명 파이썬 개발자들의 발표가 있는 컨퍼런스로 치루어졌으며, 2일간의 세션과 하루 동안의 튜토리얼, 스프린트로 이루어져 총 3일간 진행되었습니다.',
        url: 'https://archive.pycon.kr/2016'
    },
    [PreviousPyconkr.PYCONKR_2015]: {
        title: '파이콘 한국 2015',
        paragraph:
            '파이콘 한국 2015는 2015년 8월 29일, 30일 양일 동안 상암동 누리꿈스퀘어에서 700명 이상의 참석자와 30여 개의 세션과 함께 성공적으로 치루어 졌습니다. 행사가 규모면에서 참가자 및 발표 세션 수 2배가 되었고 날짜도 2일짜리 행사로 커졌을 뿐 아니라, 미국, 일본 등에서 해외 스피커 등이 참석하는 국제적인 행사의 모습을 갖추어가는 행사였습니다.',
        url: 'https://archive.pycon.kr/2015'
    },
    [PreviousPyconkr.PYCONKR_2014]: {
        title: '파이콘 한국 2014',
        paragraph:
            '파이콘 한국 2014는 한국에서 열리는 첫 번째 파이콘이었습니다. 2014년 8월 30일, 숙명여자대학교에서 450여 명의 참석자와 20여 개의 세션, 17명의 발표자와 함께 성황리에 종료되었습니다. 행사 준비와 진행을 위해 20명의 자원봉사자 분들과 11명의 준비위원회 스태프가 노력하였습니다.',
        url: 'https://archive.pycon.kr/2014'
    }
}
