export default {
    siteTitle: '파이콘 한국 2022',
    preparing: '준비 중입니다.',
    pyconkrTitle: 'PYCON KOREA 2022',
    pycon: 'PYCON',
    korea: 'KOREA',
    thisYear: '2022',
    pyconkrDate: '10.01 - 10.02',
    about: {
        main: {
            title: '파이콘 한국이란',
            desc: '파이콘은 세계 각국의 파이썬 프로그래밍 언어 커뮤니티에서 주관하는 비영리 컨퍼런스입니다. 한국에서는 처음으로 열린 파이콘 한국 2014를 시작으로 파이콘 한국 준비위원회는 건강한 국내 파이썬 생태계에 지속적인 보탬이 되고자, 커뮤니티 멤버들의 자발적인 봉사로 운영되고 있습니다.'
        },
        slogan: {
            title: 'Do Anything with Python',
            desc:
                '파이콘 한국 2022의 슬로건은 "Do Anything with Python"입니다.\n' +
                '우리 모두는 어떤 것이든 만들어 낼 수 있는 잠재력을 가지고 있습니다. 파이썬을 좋아하는 마음만 있다면요!\n' +
                '올해도 어김없이 파이콘이 열립니다.\n' +
                '파이썬 하나로 다양한 파이써니스타들이 경험을 나누고 꿈을 이야기합니다.\n' +
                '파이콘 한국 2022에서 만나요.'
        },
        diff: {
            title: '파이콘은 다른 개발자 행사와 무엇이 다른가요?',
            desc: '파이콘 한국은 커뮤니티 주관으로 이뤄지는 비영리 개발자 대상 행사로, 타 기업 및 기관에서 개최하는 개발자 행사와는 성격이 다릅니다. 발표자와 튜토리얼 진행자를 포함하여, 자원봉사자와 준비위원회 담당자 등 모든 인원이 금전적 이득 없이 순수히 오픈소스 프로그래밍 언어인 파이썬의 저변 확대와 커뮤니티 활성화를 위해 진행하는 행사입니다.'
        }
    }
}
