export default {
    siteTitle: '파이콘 한국 2022',
    preparing: '준비 중입니다.',
    pyconkrTitle: 'PYCON KOREA 2022',
    pyconkrDate: '2022년 10월 1일 ~ 10월 2일',
    about: {
        main: {
            title: '파이콘 한국이란',
            desc: '파이콘은 세계 각국의 파이썬 프로그래밍 언어 커뮤니티에서 주관하는 비영리 컨퍼런스입니다. 한국에서는 처음으로 열린 파이콘 한국 2014를 시작으로 파이콘 한국 준비위원회는 건강한 국내 파이썬 생태계에 지속적인 보탬이 되고자, 커뮤니티 멤버들의 자발적인 봉사로 운영되고 있습니다.'
        },
        diff: {
            title: '파이콘은 다른 개발자 행사와 무엇이 다른가요?',
            desc: '파이콘 한국은 커뮤니티 주관으로 이뤄지는 비영리 개발자 대상 행사로, 타 기업 및 기관에서 개최하는 개발자 행사와는 성격이 다릅니다. 발표자와 튜토리얼 진행자를 포함하여, 자원봉사자와 준비위원회 담당자 등 모든 인원이 금전적 이득 없이 순수히 오픈소스 프로그래밍 언어인 파이썬의 저변 확대와 커뮤니티 활성화를 위해 진행하는 행사입니다.'
        }
    }
}
